In [28]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [29]:
df = pd.read_csv("dataset/data_science_job.csv")

In [30]:
df.sample(10)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
8200,20947,city_136,0.897,Male,No relevent experience,no_enrollment,High School,NaN,4.0,NaN,NaN,42.0,0.0
7299,1230,city_103,0.920,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,10000+,Pvt Ltd,105.0,0.0
11723,10651,city_19,0.682,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,100-500,Pvt Ltd,14.0,0.0
14132,389,city_28,0.939,Male,Has relevent experience,no_enrollment,Masters,STEM,9.0,500-999,Public Sector,141.0,0.0
6116,21752,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,5000-9999,Pvt Ltd,92.0,0.0
10511,5990,city_21,0.624,Male,Has relevent experience,no_enrollment,Graduate,STEM,5.0,10/49,Early Stage Startup,5.0,1.0
1225,12225,city_94,0.698,Male,Has relevent experience,no_enrollment,Masters,STEM,15.0,<10,Pvt Ltd,36.0,0.0
4546,32255,city_23,0.899,NaN,Has relevent experience,NaN,Graduate,Business Degree,2.0,NaN,NaN,28.0,0.0
1547,8270,city_45,0.890,NaN,No relevent experience,Full time course,High School,NaN,4.0,NaN,NaN,326.0,1.0
1395,11068,city_21,0.624,Male,Has relevent experience,no_enrollment,Masters,STEM,9.0,NaN,NaN,100.0,1.0

In [31]:
df.isnull().sum()

enrollee_id                  0
city                         0
city_development_index     479
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
training_hours             766
target                       0
dtype: int64

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  18679 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  float64
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  training_hours          18392 non-null  float64
 12  target                  19158 non-null  float64
dtypes: float64(4), int64(1), object(8)
memory usage: 1.9+ MB

In [33]:
df.isnull().mean()*100

enrollee_id                0.000000
city                       0.000000
city_development_index     2.500261
gender                    23.530640
relevent_experience        0.000000
enrolled_university        2.014824
education_level            2.401086
major_discipline          14.683161
experience                 0.339284
company_size              30.994885
company_type              32.049274
training_hours             3.998330
target                     0.000000
dtype: float64

In [34]:
cols = [var for var in df.columns if df[var].isnull().mean() <
        0.05 and df[var].isnull().mean() > 0]

In [35]:
cols

['city_development_index',
 'enrolled_university',
 'education_level',
 'experience',
 'training_hours']

In [36]:
df[cols].sample(10)

,city_development_index,enrolled_university,education_level,experience,training_hours
16148,0.884,no_enrollment,Masters,20.0,18.0
7002,0.910,no_enrollment,Graduate,12.0,108.0
1859,0.887,no_enrollment,Graduate,13.0,192.0
18155,0.698,no_enrollment,Masters,15.0,NaN
17370,0.910,no_enrollment,Masters,18.0,55.0
7277,0.920,no_enrollment,Masters,20.0,78.0
6367,0.884,Full time course,Graduate,20.0,NaN
1339,0.689,no_enrollment,Primary School,16.0,154.0
5267,0.920,no_enrollment,Graduate,20.0,27.0
13117,0.920,Full time course,Graduate,3.0,78.0

In [37]:
df[cols].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   city_development_index  18679 non-null  float64
 1   enrolled_university     18772 non-null  object
 2   education_level         18698 non-null  object
 3   experience              19093 non-null  float64
 4   training_hours          18392 non-null  float64
dtypes: float64(3), object(2)
memory usage: 748.5+ KB

In [41]:
new_df = df[cols].dropna()

In [42]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17182 entries, 0 to 19157
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   city_development_index  17182 non-null  float64
 1   enrolled_university     17182 non-null  object
 2   education_level         17182 non-null  object
 3   experience              17182 non-null  float64
 4   training_hours          17182 non-null  float64
dtypes: float64(3), object(2)
memory usage: 805.4+ KB

In [43]:
new_df.shape

(17182, 5)

In [45]:
temp = pd.concat([df["enrolled_university"].value_counts()/len(df),
                  new_df['enrolled_university'].value_counts()/len(new_df)], axis=1)

temp.columns = ["original", "CCA"]

In [46]:
temp

                     original       CCA
enrolled_university
no_enrollment        0.721213  0.735188
Full time course     0.196106  0.200733
Part time course     0.062533  0.064079